jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs2.cpp
			return false;
		}

		m_ep0_buffer->set_buffer(0, rx_buf);
	}

	for(size_t i = 0; i < m_rx_buffer->get_num_ep(); i++)
	{
		Buffer_adapter_base* rx_buf = m_rx_buffer->poll_allocate_buffer(i);
		if(rx_buf == nullptr)
		{
			for(size_t j = 0; j < m_rx_buffer->get_num_ep(); j++)
			{
				Buffer_adapter_base* buf = m_rx_buffer->get_buffer(j);
				if(buf)
				{
					m_rx_buffer->release_buffer(j, buf);
				}
			}

			Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::fatal, "stm32_h7xx_otghs2::initialize", "could not preallocate rx buffer for ep %d", i+1);

			return false;
		}

		m_rx_buffer->set_buffer(i, rx_buf);
	}

	return true;
}

void stm32_h7xx_otghs2::get_info()
{

}

bool stm32_h7xx_otghs2::enable()
{
	//reset usb if it is on
	if(RCC->AHB1ENR & (RCC_AHB1ENR_USB1OTGHSEN | RCC_AHB1ENR_USB1OTGHSULPIEN))
	{
		if(!disable())
		{
			return false;
		}
	}

	//enable usb core clock and ulpi clock for USB1
	Register_util::set_bits(&RCC->AHB1ENR, RCC_AHB1ENR_USB1OTGHSEN | RCC_AHB1ENR_USB1OTGHSULPIEN);
	//wait for USB to be idle
	Register_util::wait_until_set(&OTG->GRSTCTL, USB_OTG_GRSTCTL_AHBIDL);

	//disable tranciever
	Register_util::clear_bits(&(OTG->GCCFG), USB_OTG_GCCFG_PWRDWN);

	//ULPI
	Register_util::clear_bits(&(OTG->GUSBCFG), USB_OTG_GUSBCFG_TSDPS | USB_OTG_GUSBCFG_ULPIFSLS | USB_OTG_GUSBCFG_PHYSEL);
	Register_util::clear_bits(&(OTG->GUSBCFG), USB_OTG_GUSBCFG_ULPIEVBUSD | USB_OTG_GUSBCFG_ULPIEVBUSI);

	//soft reset
	core_reset();

	//soft disconnect
	Register_util::set_bits(&OTGD->DCTL, USB_OTG_DCTL_SDIS);

	//start clocks, no sleep gate
	Register_util::mask_set_bits<uint32_t>(OTGPCTL, 
		USB_OTG_PCGCR_GATEHCLK | USB_OTG_PCGCR_STPPCLK,
		(1U << 5) //ENL1GTG
		);

	//config as device
	Register_util::mask_set_bits(&OTG->GUSBCFG, 
		USB_OTG_GUSBCFG_FHMOD, 
		USB_OTG_GUSBCFG_FDMOD
		);
	Register_util::mask_set_bits(&OTG->GUSBCFG, 
		USB_OTG_GUSBCFG_ULPIIPD | USB_OTG_GUSBCFG_ULPIFSLS | USB_OTG_GUSBCFG_PHYLPCS | USB_OTG_GUSBCFG_HNPCAP | USB_OTG_GUSBCFG_SRPCAP | USB_OTG_GUSBCFG_PHYSEL,
		USB_OTG_GUSBCFG_ULPIAR | USB_OTG_GUSBCFG_ULPICSM
		);
	Register_util::mask_set_bits(&OTG->GUSBCFG, 
		USB_OTG_GUSBCFG_TRDT | USB_OTG_GUSBCFG_TOCAL,
		_VAL2FLD(USB_OTG_GUSBCFG_TRDT,   0x09) | _VAL2FLD(USB_OTG_GUSBCFG_TOCAL, 0x00));
	
	//reset since we picked a phy
	core_reset();

	//No vbus sense, power down
	Register_util::clear_bits(&OTG->GCCFG, USB_OTG_GCCFG_VBDEN | USB_OTG_GCCFG_SDEN | USB_OTG_GCCFG_PDEN | USB_OTG_GCCFG_DCDEN | USB_OTG_GCCFG_BCDEN | USB_OTG_GCCFG_PWRDWN);
	
	//force B state valid
	Register_util::mask_set_bits<uint32_t>(&OTG->GOTGCTL, 
		USB_OTG_GOTGCTL_EHEN | USB_OTG_GOTGCTL_DHNPEN | USB_OTG_GOTGCTL_HSHNPEN | USB_OTG_GOTGCTL_HNPRQ | USB_OTG_GOTGCTL_AVALOVAL | USB_OTG_GOTGCTL_AVALOEN | USB_OTG_GOTGCTL_VBVALOVAL | USB_OTG_GOTGCTL_VBVALOEN | USB_OTG_GOTGCTL_SRQ,
		USB_OTG_GOTGCTL_OTGVER | USB_OTG_GOTGCTL_BVALOEN | USB_OTG_GOTGCTL_BVALOVAL
		);

	Register_util::mask_set_bits(
		&OTGD->DCFG, 
		USB_OTG_DCFG_PERSCHIVL | USB_OTG_DCFG_PFIVL | USB_OTG_DCFG_DAD | USB_OTG_DCFG_DSPD,
		_VAL2FLD(USB_OTG_DCFG_PERSCHIVL, 0x01) | _VAL2FLD(USB_OTG_DCFG_PFIVL, 0x00) | _VAL2FLD(USB_OTG_DCFG_DAD, 0x00) | USB_OTG_DCFG_NZLSOHSK | _VAL2FLD(USB_OTG_DCFG_DSPD, 0x00)
		);


	//reset fifo assignments
	//64bytes / 16 words starting at offset 2048
	for (size_t i = 1; i < MAX_NUM_EP; i++)
	{
		OTG->DIEPTXF[i-1] = _VAL2FLD(USB_OTG_DIEPTXF_INEPTXFD, 16) | _VAL2FLD(USB_OTG_DIEPTXF_INEPTXSA, 2048+16*4*i);
	}

	//rx fifo
	OTG->GRXFSIZ = RX_FIFO_SIZE;
	//ep0 tx fifo, TX0FD | TX0FSA
	if(!config_ep_tx_fifo(0, 3*(64 + 8 + 4)))
	{
		return false;
	}

	//flush fifo
	flush_all_tx();
	flush_rx();

	//maks all interrupts, clear core interrupt, no dma, 4x32 burst transfer
	Register_util::mask_set_bits(&OTG->GAHBCFG, 
		USB_OTG_GAHBCFG_DMAEN | USB_OTG_GAHBCFG_HBSTLEN | USB_OTG_GAHBCFG_GINT, 
		USB_OTG_GAHBCFG_PTXFELVL | USB_OTG_GAHBCFG_TXFELVL | _VAL2FLD(USB_OTG_GAHBCFG_HBSTLEN, 3));
	OTG->GINTMSK = 0U;
	OTG->GINTSTS = 0xFFFFFFFF;

	//device msk
	OTGD->DAINTMSK = 0U;
	//OUT msk
	OTGD->DOEPMSK  = 0U;
	//in msk
	OTGD->DIEPMSK  = 0U;

	//config core interrupt
	OTG->GINTMSK  = USB_OTG_GINTMSK_ENUMDNEM |
					USB_OTG_GINTMSK_USBRST   |
    				USB_OTG_GINTMSK_USBSUSPM |
					USB_OTG_GINTMSK_ESUSPM   |
    				USB_OTG_GINTMSK_SOFM     |
					USB_OTG_GINTMSK_OTGINT   |
					USB_OTG_GINTMSK_MMISM
					;

	//turn on global interrupt
	Register_util::set_bits(&OTG->GAHBCFG, USB_OTG_GAHBCFG_GINT);
	Register_util::set_bits(&OTG->GINTSTS, USB_OTG_GINTSTS_RXFLVL);
	Register_util::set_bits(&OTG->GINTMSK, USB_OTG_GINTSTS_RXFLVL);
	

	m_state = STATE::ATTATCHED;

	return true;
}
bool stm32_h7xx_otghs2::disable()
{
	if(RCC->AHB1ENR & (RCC_AHB1ENR_USB1OTGHSEN | RCC_AHB1ENR_USB1OTGHSULPIEN))
	{
		//reset USB1
		Register_util::set_bits(&RCC->AHB1RSTR,   RCC_AHB1RSTR_USB1OTGHSRST);
		Register_util::clear_bits(&RCC->AHB1RSTR, RCC_AHB1RSTR_USB1OTGHSRST);

		//gate clocks
		Register_util::clear_bits(&RCC->AHB1ENR, RCC_AHB1ENR_USB1OTGHSEN | RCC_AHB1ENR_USB1OTGHSULPIEN);

		//flush pipeline
		Cortex_m7::data_instruction_sync();
	}

	return true;
}

bool stm32_h7xx_otghs2::connect()
{
	Register_util::clear_bits(&OTGD->DCTL, USB_OTG_DCTL_SDIS);

	m_state = STATE::WAIT_RESET;

	return true;
}
bool stm32_h7xx_otghs2::disconnect()
{
	Register_util::set_bits(&OTGD->DCTL, USB_OTG_DCTL_SDIS);

	//flush
	Cortex_m7::data_instruction_sync();

	flush_all_tx();
	flush_rx();
	core_reset();

	Cortex_m7::data_instruction_sync();

	m_state = STATE::ATTATCHED;

	return true;
}

bool stm32_h7xx_otghs2::set_address(const uint8_t addr)
{
	Register_util::mask_set_bits(&OTGD->DCFG, USB_OTG_DCFG_DAD, _VAL2FLD(USB_OTG_DCFG_DAD, uint32_t(addr)));

	return true;
}

bool stm32_h7xx_otghs2::ep_config(const ep_cfg& ep)
{
	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2::ep_config", "config ep 0x%02X", ep.num);
	
	const uint8_t ep_addr = USB_common::get_ep_addr(ep.num);

	if(ep_addr == 0)
	{
		if(ep.type != usb_driver_base::EP_TYPE::CONTROL)
		{
			return false;
		}

		volatile USB_OTG_INEndpointTypeDef*  const ep_in  = get_ep_in(ep_addr);
		volatile USB_OTG_OUTEndpointTypeDef* const ep_out = get_ep_out(ep_addr);

		uint8_t mpsize = 0;
		m_ep0_cfg = ep;
		if(ep.size <= 8)
		{
			m_ep0_cfg.size = 8;
			mpsize = 3;
		}
		else if(ep.size <= 16)
		{
			m_ep0_cfg.size = 16;
			mpsize = 2;
		}
		else if(ep.size <= 32)
		{
			m_ep0_cfg.size = 32;
			mpsize = 1;
		}
		else
		{
			m_ep0_cfg.size = 64;
			mpsize = 0;
		}

		OTGD->DAINTMSK |= 0x00010001;
		
		ep_in->DIEPTSIZ = 
			_VAL2FLD(USB_OTG_DIEPTSIZ_PKTCNT, 0) |
			_VAL2FLD(USB_OTG_DOEPTSIZ_XFRSIZ, m_ep0_cfg.size);

		ep_out->DOEPTSIZ = 
			_VAL2FLD(USB_OTG_DOEPTSIZ_STUPCNT, 3) |
			USB_OTG_DOEPTSIZ_PKTCNT               |
			_VAL2FLD(USB_OTG_DOEPTSIZ_XFRSIZ, m_ep0_cfg.size);
		
