jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs2.cpp
		Register_util::clear_bits(&epin->DIEPCTL, USB_OTG_DIEPCTL_STALL);

		if(ep_addr != 0)
		{
			if((cfg.type == EP_TYPE::BULK) || (cfg.type == EP_TYPE::INTERRUPT))
			{
				Register_util::set_bits(&epin->DIEPCTL, USB_OTG_DIEPCTL_SD0PID_SEVNFRM);
			}
		}
	}
	else
	{
		volatile USB_OTG_OUTEndpointTypeDef* epout = get_ep_out(ep_addr);

		Register_util::clear_bits(&epout->DOEPCTL, USB_OTG_DOEPCTL_STALL);
		if(ep_addr != 0)
		{
			if((cfg.type == EP_TYPE::BULK) || (cfg.type == EP_TYPE::INTERRUPT))
			{
				Register_util::set_bits(&epout->DOEPCTL, USB_OTG_DOEPCTL_SD0PID_SEVNFRM);
			}
		}
	}
}

int stm32_h7xx_otghs2::ep_write(const uint8_t ep, const uint8_t* buf, const uint16_t len)
{
	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2::ep_write", "");

	if(!USB_common::is_in_ep(ep))
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2::ep_write", "not an in ep");
		return -1;
	}

	const uint8_t ep_addr = USB_common::get_ep_addr(ep);

	volatile USB_OTG_INEndpointTypeDef* const epin = get_ep_in(ep_addr);

	const size_t len32 = (len + 3) / 4;

	//number of words availible
	const uint32_t DTXFSTS = epin->DTXFSTS;
	const uint32_t INEPTFSAV = _FLD2VAL(USB_OTG_DTXFSTS_INEPTFSAV, DTXFSTS);
	if(INEPTFSAV < len32)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2::ep_write", "wanted %d but only %d avail on 0x%02X", len32, INEPTFSAV, ep);
		return -1;
	}

	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2::ep_write", "ep%d", ep_addr);
	for(size_t i = 0; i < len; i++)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2::ep_write", "%02X ", buf[i]);
	}

	if(ep_addr == 0)
	{
		Register_util::mask_set_bits(
							&epin->DIEPTSIZ,
							USB_OTG_DIEPTSIZ_PKTCNT | USB_OTG_DIEPTSIZ_XFRSIZ,
							_VAL2FLD(USB_OTG_DIEPTSIZ_PKTCNT, 1) | _VAL2FLD(USB_OTG_DIEPTSIZ_XFRSIZ, len)
						);
		Register_util::mask_set_bits(
			&epin->DIEPCTL, 
			USB_OTG_DIEPCTL_SD0PID_SEVNFRM, 
			USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK);
	}
	else
	{
		if(epin->DIEPCTL & USB_OTG_DOEPCTL_EPENA)
		{
			Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2::ep_write", "endpoint already active");
			return -1;
		}

		Register_util::mask_set_bits(
							&epin->DIEPTSIZ,
							USB_OTG_DIEPTSIZ_MULCNT | USB_OTG_DIEPTSIZ_PKTCNT | USB_OTG_DIEPTSIZ_XFRSIZ,
							_VAL2FLD(USB_OTG_DIEPTSIZ_MULCNT, 0) | _VAL2FLD(USB_OTG_DIEPTSIZ_PKTCNT, 1) | _VAL2FLD(USB_OTG_DIEPTSIZ_XFRSIZ, len)
						);
		
		Register_util::mask_set_bits(
			&epin->DIEPCTL,
			USB_OTG_DIEPCTL_STALL | USB_OTG_DIEPCTL_SD0PID_SEVNFRM,
			USB_OTG_DIEPCTL_CNAK  | USB_OTG_DIEPCTL_EPENA);
	}

	volatile uint32_t* const fifo = get_ep_fifo(ep_addr);
	for(size_t i = 0; i < len; i+=4)
	{
		const size_t u8_left = len - i;

		//copy all 4 if avail, otherwise only the remaining
		if(u8_left >= 4)
		{	
			const uint8_t b0 = buf[i + 0];
			const uint8_t b1 = buf[i + 1];
			const uint8_t b2 = buf[i + 2];
			const uint8_t b3 = buf[i + 3];

			*fifo = Byte_util::make_u32(b3, b2, b1, b0);
		}
		else
		{
			uint8_t b0, b1, b2;

			switch(u8_left)
			{
				case 1:
				{
					b0 = buf[i + 0];
					b1 = 0;
					b2 = 0;
					break;
				}
				case 2:
				{
					b0 = buf[i + 0];
					b1 = buf[i + 1];
					b2 = 0;
					break;
				}
				case 3:
				{
					b0 = buf[i + 0];
					b1 = buf[i + 1];
					b2 = buf[i + 2];
					break;
				}
				case 0:
				default:
				{
					b0 = 0;
					b1 = 0;
					b2 = 0;
					break;
				}
			}

			*fifo = Byte_util::make_u32(0, b2, b1, b0);
		}
	}

	return len;
}
int stm32_h7xx_otghs2::ep_read(const uint8_t ep, uint8_t* const buf, const uint16_t max_len)
{
	//no data
	if(!(OTG->GINTSTS & USB_OTG_GINTSTS_RXFLVL))
	{
		return 0;
	}

	if(buf == nullptr)
	{
		freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
		logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "ep_read buf is null");
		return 0;
	}

	for(size_t i = 0; i < max_len; i += 4)
	{
		const uint32_t temp = *get_ep_fifo(0);

		const size_t bleft = max_len - i;
		if(bleft >= 4)
		{
			buf[i+0] = Byte_util::get_b0(temp);
			buf[i+1] = Byte_util::get_b1(temp);
			buf[i+2] = Byte_util::get_b2(temp);
			buf[i+3] = Byte_util::get_b3(temp);
		}
		else
		{
			switch(bleft)
			{
				case 1:
				{
					buf[i+0] = Byte_util::get_b0(temp);
					break;
				}
				case 2:
				{
					buf[i+0] = Byte_util::get_b0(temp);
					buf[i+1] = Byte_util::get_b1(temp);
					break;
				}
				case 3:
				{
					buf[i+0] = Byte_util::get_b0(temp);
					buf[i+1] = Byte_util::get_b1(temp);
					buf[i+2] = Byte_util::get_b2(temp);
					break;
				}
				default:
				{
					break;
				}
			}
		}
	}

	return max_len;
}

uint16_t stm32_h7xx_otghs2::get_frame_number()
{
	return _FLD2VAL(USB_OTG_DSTS_FNSOF, OTGD->DSTS);
}

USB_common::USB_SPEED stm32_h7xx_otghs2::get_speed() const
{
	switch(_FLD2VAL(USB_OTG_DSTS_ENUMSPD, OTGD->DSTS))
	{
		case 0:
		{
			return USB_common::USB_SPEED::HS;
		}
		case 2:
		{
			return USB_common::USB_SPEED::LS;
		}
		case 1:
		case 3:
		default:
		{
			return USB_common::USB_SPEED::FS;
		}
	}
}

void stm32_h7xx_otghs2::poll(const USB_common::Event_callback& func)
{
	const uint32_t GINTSTS = OTG->GINTSTS;
	const uint32_t GINTMSK = OTG->GINTMSK;

	freertos_util::logging::Logger* const logger = Global_logger::get();

	//TODO: eat SOF for now
	if(GINTSTS & USB_OTG_GINTSTS_SOF)
	{
		OTG->GINTSTS = USB_OTG_GINTSTS_SOF;
		return;
	}

	logger->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS: 0x%08X, USB_OTG_GINTMSK: 0x%08X", GINTSTS, GINTMSK);

	//Mode mismatch error
	if(GINTSTS & USB_OTG_GINTSTS_MMIS)
	{
		logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_MMIS");
		OTG->GINTSTS = USB_OTG_GINTSTS_MMIS;
	}

	//OTG event
	if(GINTSTS & USB_OTG_GINTSTS_OTGINT)
	{
		logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_OTGINT");
		const uint32_t GOTGINT = OTG->GOTGINT;
		if(GOTGINT & USB_OTG_GOTGINT_SEDET)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "USB_OTG_GOTGINT_SEDET");
			OTG->GOTGINT = USB_OTG_GOTGINT_SEDET;
		}
		if(GOTGINT & USB_OTG_GOTGINT_SRSSCHG)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "USB_OTG_GOTGINT_SRSSCHG");
			OTG->GOTGINT = USB_OTG_GOTGINT_SRSSCHG;
		}
		if(GOTGINT & USB_OTG_GOTGINT_HNSSCHG)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "USB_OTG_GOTGINT_HNSSCHG");
			OTG->GOTGINT = USB_OTG_GOTGINT_HNSSCHG;
		}
		if(GOTGINT & USB_OTG_GOTGINT_HNGDET)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "USB_OTG_GOTGINT_HNGDET");
			OTG->GOTGINT = USB_OTG_GOTGINT_HNGDET;
		}
		if(GOTGINT & USB_OTG_GOTGINT_ADTOCHG)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "USB_OTG_GOTGINT_ADTOCHG");
			OTG->GOTGINT = USB_OTG_GOTGINT_ADTOCHG;
		}
		if(GOTGINT & USB_OTG_GOTGINT_DBCDNE)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "USB_OTG_GOTGINT_DBCDNE");
			OTG->GOTGINT = USB_OTG_GOTGINT_DBCDNE;
		}
	}

	if(GINTSTS & USB_OTG_GINTSTS_USBRST)
	{
		logger->log(freertos_util::logging::LOG_LEVEL::info, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_USBRST");

		OTG->GINTSTS = USB_OTG_GINTSTS_USBRST;

		handle_reset_done();

		USB_common::USB_EVENTS event = USB_common::USB_EVENTS::RESET;
		func(event, 0);
	}
	else
	{
		if(GINTSTS & USB_OTG_GINTSTS_ENUMDNE)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::info, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_ENUMDNE");

