jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs2.cpp
			OTG->GINTSTS = USB_OTG_GINTSTS_ENUMDNE;

			handle_enum_done();

			USB_common::USB_EVENTS event = USB_common::USB_EVENTS::ENUM_DONE;
			func(event, 0);
		}
		if(GINTSTS & USB_OTG_GINTSTS_SOF)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_SOF");

			OTG->GINTSTS = USB_OTG_GINTSTS_SOF;

			USB_common::USB_EVENTS event = USB_common::USB_EVENTS::SOF;
			func(event, 0);
		}
		if(GINTSTS & USB_OTG_GINTSTS_ESUSP)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::info, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_ESUSP");
		
			OTG->GINTSTS = USB_OTG_GINTSTS_ESUSP;

			USB_common::USB_EVENTS event = USB_common::USB_EVENTS::EARLY_SUSPEND;
			func(event, 0);
		}
		if(GINTSTS & USB_OTG_GINTSTS_USBSUSP)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::info, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_USBSUSP");

			OTG->GINTSTS = USB_OTG_GINTSTS_USBSUSP;

			USB_common::USB_EVENTS event = USB_common::USB_EVENTS::SUSPEND;
			func(event, 0);
		}

		//check for io

		if(GINTSTS & USB_OTG_GINTSTS_IEPINT)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_IEPINT");

			if(!handle_iepintx(func))
			{
				logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "handle_iepintx had an error");
			}
		}
		
		if(GINTSTS & USB_OTG_GINTSTS_OEPINT)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_OEPINT");

			if(!handle_oepintx(func))
			{
				logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "handle_oepintx had an error");
			}
		}
		
		if(GINTSTS & USB_OTG_GINTSTS_RXFLVL)
		{
			logger->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL");

			//pop top fifo entry
			const uint32_t GRXSTSP = OTG->GRXSTSP;

			logger->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL GINTSTS 0x%08X", GINTSTS);
			logger->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL GRXSTSP 0x%08X", GRXSTSP);

			const uint32_t STSPHST = (GRXSTSP & 0x08000000) >> 27;
			const uint32_t FRMNUM  = (GRXSTSP & 0x01E00000) >> 21;
			const uint32_t PKTSTS  = _FLD2VAL(USB_OTG_GRXSTSP_PKTSTS, GRXSTSP);
			const uint32_t DPID    = _FLD2VAL(USB_OTG_GRXSTSP_DPID,   GRXSTSP);
			const uint32_t BCNT    = _FLD2VAL(USB_OTG_GRXSTSP_BCNT,   GRXSTSP);
			const uint32_t EPNUM   = _FLD2VAL(USB_OTG_GRXSTSP_EPNUM,  GRXSTSP);
			const uint8_t ep_num = EPNUM;

			Stack_string<128> msg;
			msg.clear();
			msg.sprintf("\tSTSPHST %" PRIu32 "\r\n", STSPHST);
			msg.sprintf("\tFRMNUM  %" PRIu32 "\r\n", FRMNUM);
			msg.sprintf("\tPKTSTS  %" PRIu32 "\r\n", PKTSTS);
			msg.sprintf("\tDPID    %" PRIu32 "\r\n", DPID);
			msg.sprintf("\tBCNT    %" PRIu32 "\r\n", BCNT);
			msg.sprintf("\tEPNUM   %" PRIu32,        EPNUM);
			logger->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "GRXSTSP:\r\n%s", msg.c_str());

			switch(PKTSTS)
			{
				case 2://out rx
				{
					logger->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL 2");

					if(BCNT != 0)
					{
						if(ep_num != 0)
						{
							//get active buffer
							Buffer_adapter_base* curr_buf = m_rx_buffer->get_buffer(ep_num);

							//read data from core's fifo into buffer
							curr_buf->reset();
							curr_buf->resize(BCNT);
							ep_read(ep_num, curr_buf->data(), BCNT);

							//enqueue buffer so the application thread can be notified and read it
							if(m_rx_buffer->poll_enqueue_buffer(ep_num, curr_buf))
							{
								logger->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL PKTSTS 2 rx buffer poll_enqueue_buffer ok");
							}
							else
							{
								logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL PKTSTS 2 rx buffer poll_enqueue_buffer fail");
							}

							for(size_t i = 0; i < BCNT; i++)
							{
								logger->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL %02X ", curr_buf->data()[i]);
							}

							//try to get a new buffer
							Buffer_adapter_base* new_buf = m_rx_buffer->poll_allocate_buffer(ep_num);
							//update the active buffer
							if(new_buf)
							{
								new_buf->reset();
								m_rx_buffer->set_buffer(ep_num, new_buf);
								get_ep_out(ep_num)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
							}
							else
							{
								//OUT buffer underrun
								//we will need to cnak and epena when the app frees a buffer
								logger->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL rx buffer underrun");
								
								m_rx_buffer->set_buffer(ep_num, nullptr);
								get_ep_out(ep_num)->DOEPCTL |= (USB_OTG_DOEPCTL_SNAK);

								//if no curr_buf, mask USB_OTG_GINTSTS_RXFLVL
								Register_util::clear_bits(&OTG->GINTMSK, USB_OTG_GINTSTS_RXFLVL);
							}
						}
						else
						{
							//get active buffer
							Buffer_adapter_base* curr_buf = m_ep0_buffer->get_buffer(0);

							//read data from core's fifo into buffer
							curr_buf->reset();
							curr_buf->resize(BCNT);
							ep_read(0, curr_buf->data(), BCNT);

							//enqueue buffer so the application thread can be notified and read it
							m_ep0_buffer->poll_enqueue_buffer(0, curr_buf);

							for(size_t i = 0; i < BCNT; i++)
							{
								logger->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL %02X ", curr_buf->data()[i]);
							}

							//try to get a new buffer
							Buffer_adapter_base* new_buf = m_ep0_buffer->poll_allocate_buffer(0);
							//update the active buffer
							if(new_buf)
							{
								new_buf->reset();
								m_ep0_buffer->set_buffer(0, new_buf);
								get_ep_out(0)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
							}
							else
							{
								//OUT buffer underrun
								//we will need to cnak and epena when the app frees a buffer
								logger->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL rx buffer allocation fail");
								m_ep0_buffer->set_buffer(0, nullptr);
								get_ep_out(0)->DOEPCTL |= (USB_OTG_DOEPCTL_SNAK);
							}
						}
					}

					break;
				}
				case 3://out txfr done
				{
					logger->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL OUT TXFR DONE");
					break;
				}
				case 6://setup packet rx
				{
					logger->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL pksts 6");

					if(BCNT != 0)
					{
						ep_read(ep_num, m_last_setup_packet.data(), BCNT);

						for(size_t i = 0; i < m_last_setup_packet.size(); i++)
						{
							logger->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL %02X ", m_last_setup_packet[i]);
						}
					}

					break;
				}
				case 4://setup stage done, data stage started
				{
					logger->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL pksts 4");

