jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs2.cpp
					logger->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_RXFLVL event SETUP_PACKET_RX");

					get_ep_out(ep_num)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
					break;
				}
				case 1://global nak
				default:
				{
					break;
				}
			}
		}
	}
}

void stm32_h7xx_otghs2::set_data0(const uint8_t ep)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep);

	if(USB_common::is_in_ep(ep))
	{
		volatile USB_OTG_INEndpointTypeDef* epin = get_ep_in(ep_addr);

		Register_util::set_bits(&epin->DIEPCTL, USB_OTG_DIEPCTL_SD0PID_SEVNFRM);
	}
	else
	{
		volatile USB_OTG_OUTEndpointTypeDef* epout = get_ep_out(ep_addr);

		Register_util::set_bits(&epout->DOEPCTL, USB_OTG_DOEPCTL_SD0PID_SEVNFRM);
	}
}

void stm32_h7xx_otghs2::flush_rx()
{
	//verify rx read idle
	//???
	//verify rx write idle
	//???

	Register_util::set_bits(&OTG->GRSTCTL, USB_OTG_GRSTCTL_RXFFLSH);
	Register_util::wait_until_clear(&OTG->GRSTCTL, USB_OTG_GRSTCTL_RXFFLSH);
}

void stm32_h7xx_otghs2::flush_tx(const uint8_t ep)
{
	//verify tx read idle
	//???
	//verify tx write idle
	Register_util::wait_until_set(&OTG->GRSTCTL, USB_OTG_GRSTCTL_AHBIDL);

	Register_util::wait_until_clear(&OTG->GRSTCTL, USB_OTG_GRSTCTL_TXFFLSH);

	Register_util::mask_set_bits(
		&OTG->GRSTCTL, 
		USB_OTG_GRSTCTL_TXFNUM, 
		_VAL2FLD(USB_OTG_GRSTCTL_TXFNUM, ep) | USB_OTG_GRSTCTL_TXFFLSH
	);

	Register_util::wait_until_clear(&OTG->GRSTCTL, USB_OTG_GRSTCTL_TXFFLSH);
}

void stm32_h7xx_otghs2::flush_all_tx()
{
	flush_tx(0x20);
}

const usb_driver_base::ep_cfg& stm32_h7xx_otghs2::get_ep0_config() const
{
	return m_ep0_cfg;
}
bool stm32_h7xx_otghs2::get_rx_ep_config(const uint8_t addr, ep_cfg* const out_ep)
{
	if(addr > MAX_NUM_EP)
	{
		return false;
	}

	*out_ep = m_tx_ep_cfg[addr - 1];
	return true;
}
bool stm32_h7xx_otghs2::get_tx_ep_config(const uint8_t addr, ep_cfg* const out_ep)
{
	if(addr > MAX_NUM_EP)
	{
		return false;
	}
	
	*out_ep = m_tx_ep_cfg[addr - 1];
	return true;
}

//application waits for a buffer with data
//this might be better as a stream thing rather than buffer exchange
Buffer_adapter_base* stm32_h7xx_otghs2::wait_rx_buffer(const uint8_t ep_num)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep_num);

	return m_rx_buffer->wait_dequeue_buffer(ep_addr);
}
//application returns rx buffer to driver. will allow reception to continue in event of buffer underrun
void stm32_h7xx_otghs2::release_rx_buffer(const uint8_t ep_num, Buffer_adapter_base* const buf)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep_num);
	
	Scoped_ISR_Mask otg_mask(OTG_HS_IRQn);

	m_rx_buffer->release_buffer(ep_addr, buf);

	//TODO: we may need to mask usb isr here
	//it might be safe for now, since we only do this if the ep has no loaded OUT buffer
	//which means that NAK is set
	if(m_rx_buffer->get_buffer(ep_addr) == nullptr)
	{
		//clear a OUT nak, since we have a new buffer to read to

		Buffer_adapter_base* act_buf = m_rx_buffer->poll_allocate_buffer(ep_addr);
		
		m_rx_buffer->set_buffer(ep_addr, act_buf);

		//clear the NAK, enable EP
		get_ep_out(ep_num)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);

		//enable the RXFLVL ISR
		Register_util::set_bits(&OTG->GINTMSK, USB_OTG_GINTSTS_RXFLVL);
	}
}

//application wait for usable tx buffer
Buffer_adapter_base* stm32_h7xx_otghs2::wait_tx_buffer(const uint8_t ep_num)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep_num);

	return m_tx_buffer->wait_allocate_buffer(ep_addr);
}
//application give buffer to driver for transmission
bool stm32_h7xx_otghs2::enqueue_tx_buffer(const uint8_t ep_num, Buffer_adapter_base* const buf)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep_num);

	Scoped_ISR_Mask otg_mask(OTG_HS_IRQn);

	//TODO: we may need to mask usb isr here
	//it might be safe for now, since we only do this if the ep has no loaded IN buffer
	//which means that NAK is set

	if(m_tx_buffer->get_buffer(ep_addr) == nullptr)
	{
		m_tx_buffer->set_buffer(ep_addr, buf);

		ep_write(ep_num, buf->data(), buf->size());
	}
	else
	{
		if(!m_tx_buffer->poll_enqueue_buffer(ep_addr, buf))
		{
			Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs2", "Failed to enqueue buffer");
			return false;
		}
	}

	return true;
}

bool stm32_h7xx_otghs2::handle_iepintx(const USB_common::Event_callback& func)
{
	const uint32_t IEPINT = _FLD2VAL(USB_OTG_DAINT_IEPINT, OTGD->DAINT);

	if(IEPINT == 0)
	{
		return true;
	}

	USB_common::USB_EVENTS event = USB_common::USB_EVENTS::NONE;
	const uint8_t ep_num = __builtin_ctz(IEPINT);

	volatile USB_OTG_INEndpointTypeDef* epin = get_ep_in(ep_num);
	const uint32_t DIEPINT = epin->DIEPINT;

	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_IEPINT %d IEPINT  0x%08X", ep_num, IEPINT);
	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_IEPINT %d DIEPINT 0x%08X", ep_num, DIEPINT);

	if(DIEPINT & USB_OTG_DIEPINT_NAK)//NAK is tx or rx
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_DIEPINT_NAK on ep %d", ep_num);

		epin->DIEPINT = USB_OTG_DIEPINT_NAK;
	}
	// if(DIEPINT & USB_OTG_DIEPINT_BERR)//b12 is reserved
	// {

	// }
	if(DIEPINT & USB_OTG_DIEPINT_PKTDRPSTS)//ISOC out packet has been dropped
	{
		epin->DIEPINT = USB_OTG_DIEPINT_PKTDRPSTS;
		//does not interrupt
	}
	// else if(DIEPINT & USB_OTG_DIEPINT_BNA)//b9 is reserved
	// {

	// }
	if(DIEPINT & USB_OTG_DIEPINT_TXFIFOUDRN)//tx fifo underrn, thresholding must be enabled
	{
		epin->DIEPINT = USB_OTG_DIEPINT_TXFIFOUDRN;
	}
	// else if(DIEPINT & USB_OTG_DIEPINT_TXFE)
	// {
	// 	//transmit fifo empty
	// 	//half or completely based on GAHBCFG
	// }
	// if(DIEPINT & USB_OTG_DIEPINT_INEPNE)//IN EPNE - in ep nak effective
	// {
	// 	//clear by writing CNAK in diepctlx
	// }
	if(DIEPINT & 1U << 5)//IN EPNM - in token received with ep mismatch
	{
		epin->DIEPINT = 1U << 5;
	}
	if(DIEPINT & USB_OTG_DIEPINT_ITTXFE)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_DIEPINT_ITTXFE on ep %d", ep_num);
		epin->DIEPINT = USB_OTG_DIEPINT_ITTXFE;
	}
	if(DIEPINT & USB_OTG_DIEPINT_TOC)
	{
		epin->DIEPINT = USB_OTG_DIEPINT_TOC;
						Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_IEPINT DIEPINT[%d] TOC 0x%08X", ep_num, DIEPINT);
	}
	if(DIEPINT & 1U << 2)//AHB error
	{
		epin->DIEPINT = 1U << 2;
	}
	if(DIEPINT & USB_OTG_DIEPINT_EPDISD)
	{
		epin->DIEPINT = USB_OTG_DIEPINT_EPDISD;
	}
	if(DIEPINT & USB_OTG_DIEPINT_XFRC)
	{
		epin->DIEPINT = USB_OTG_DIEPINT_XFRC;

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_IEPINT DIEPINT[%d] XFRC 0x%08X", ep_num, DIEPINT);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_IEPINT event EP_TX");

		{
			Buffer_adapter_base* const curr_tx_buf = m_tx_buffer->get_buffer(ep_num);
			if(curr_tx_buf)
			{
				m_tx_buffer->release_buffer(ep_num, curr_tx_buf);
			}
		}

		//see if there is a new packet to enqueue
		Buffer_adapter_base* const new_tx_buf = m_tx_buffer->poll_dequeue_buffer(ep_num);
		if(new_tx_buf)
		{
			m_tx_buffer->set_buffer(ep_num, new_tx_buf);
			ep_write(0x80 | ep_num, new_tx_buf->data(), new_tx_buf->size());
		}
		else
		{
			m_tx_buffer->set_buffer(ep_num, nullptr);
			get_ep_in(ep_num)->DIEPCTL |= (USB_OTG_DOEPCTL_SNAK);
		}

		if(ep_num == 0)
		{
			func(USB_common::USB_EVENTS::EP_TX, 0x80 | ep_num);
		}
	}
	else
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_IEPINT %d IEPINT  0x%08X",  ep_num, IEPINT);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "USB_OTG_GINTSTS_IEPINT %d DIEPINT 0x%08X", ep_num, DIEPINT);
	}

