jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs2.cpp
	return true;
}

bool stm32_h7xx_otghs2::handle_oepintx(const USB_common::Event_callback& func)
{
	const uint32_t OEPINT = _FLD2VAL(USB_OTG_DAINT_OEPINT, OTGD->DAINT);

	if(OEPINT == 0)
	{
		return true;
	}

	USB_common::USB_EVENTS event = USB_common::USB_EVENTS::NONE;
	const uint8_t ep_num = __builtin_ctz(OEPINT);

	volatile USB_OTG_OUTEndpointTypeDef* epout = get_ep_out(ep_num);
	const uint32_t DOEPINT = epout->DOEPINT;

	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "handle_oepintx USB_OTG_GINTSTS_OEPINT %d OEPINT  0x%08X", ep_num, OEPINT);
	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "handle_oepintx USB_OTG_GINTSTS_OEPINT %d DOEPINT 0x%08X", ep_num, DOEPINT);

	if(DOEPINT & 1U << 15)//STPKTRX
	{
		//setup packet received in buffer dma mode
		epout->DOEPINT = 1U << 15;
	}
	if(DOEPINT & USB_OTG_DOEPINT_NYET)
	{
		epout->DOEPINT = USB_OTG_DOEPINT_NYET;
	}
	if(DOEPINT & 1U << 13)//NAK
	{
		epout->DOEPINT = 1U << 13;
	}
	if(DOEPINT & 1U << 12)//BERR - babble error
	{
		epout->DOEPINT = 1U << 12;
	}
	if(DOEPINT & 1U << 8)//OUTPKTERR - overflow or crc error
	{
		epout->DOEPINT = 1U << 8;
	}
	if(DOEPINT & USB_OTG_DOEPINT_B2BSTUP)//back to back setup, more than 3 rxd
	{
		epout->DOEPINT = USB_OTG_DOEPINT_B2BSTUP;
	}
	if(DOEPINT & USB_OTG_DOEPINT_OTEPSPR)//status phase - host switched from data phase to status phase
	{
		//really STSPHSRX
		//status phase received for control write
		//core has rxd all the data the host will send
		epout->DOEPINT = USB_OTG_DOEPINT_OTEPSPR;

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "handle_oepintx USB_OTG_GINTSTS_OEPINT DOEPINT[%d] OTEPSPR 0x%08X", ep_num, DOEPINT);

		//Status phase received for control write
		//we are now in status phase, send an ACK or stall for the status phase

		func(USB_common::USB_EVENTS::CTRL_DATA_PHASE_DONE, ep_num);
	}
	if(DOEPINT & USB_OTG_DOEPINT_OTEPDIS)//out token received when endpoint disabled
	{
		epout->DOEPINT = USB_OTG_DOEPINT_OTEPDIS;
	}
	if(DOEPINT & USB_OTG_DOEPINT_STUP)//setup phase done - control endpoint has setup packet and no more came in, decode it now
	{
		epout->DOEPINT = USB_OTG_DOEPINT_STUP;

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "handle_oepintx USB_OTG_GINTSTS_OEPINT DOEPINT[%d] STUP 0x%08X", ep_num, DOEPINT);

		//SETUP phase done
		//no more back to back setup packets
		//decode the setup packet now

		const uint32_t DOEPTSIZ = get_ep_out(ep_num)->DOEPTSIZ;

		const uint32_t XFRSIZ  = _FLD2VAL(USB_OTG_DOEPTSIZ_XFRSIZ, DOEPTSIZ);
		const uint32_t PKTCNT  = _FLD2VAL(USB_OTG_DOEPTSIZ_PKTCNT, DOEPTSIZ);
		const uint32_t STUPCNT = _FLD2VAL(USB_OTG_DOEPTSIZ_STUPCNT, DOEPTSIZ);

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "handle_oepintx USB_OTG_DOEPINT_STUP XFRSIZ %08X", XFRSIZ);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "handle_oepintx USB_OTG_DOEPINT_STUP PKTCNT %08X", PKTCNT);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "handle_oepintx USB_OTG_DOEPINT_STUP STUPCNT %08X", STUPCNT);

		func(USB_common::USB_EVENTS::CTRL_SETUP_PHASE_DONE, ep_num);
	}
	if(DOEPINT & 1U << 2)//AHB error
	{
		epout->DOEPINT = 1U << 2;
	}
	if(DOEPINT & USB_OTG_DOEPINT_EPDISD)//core acks that app requested ep is disabled
	{
		epout->DOEPINT = USB_OTG_DOEPINT_EPDISD;
	}
	if(DOEPINT & USB_OTG_DOEPINT_XFRC)//programmed transfer is complete for this endpoint on AHB and USB
	{
		epout->DOEPINT = USB_OTG_DOEPINT_XFRC;

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "handle_oepintx USB_OTG_GINTSTS_OEPINT DOEPINT[%d] XFRC 0x%08X", ep_num, DOEPINT);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "handle_oepintx USB_OTG_DOEPINT_XFRC event EP_RX");

		if(ep_num == 0)
		{
			func(USB_common::USB_EVENTS::EP_RX, ep_num);
		}
	}
	else
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "handle_oepintx USB_OTG_GINTSTS_OEPINT %d OEPINT  0x%08X",  ep_num, OEPINT);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs2", "handle_oepintx USB_OTG_GINTSTS_OEPINT %d DOEPINT 0x%08X",  ep_num, DOEPINT);		
	}

	return true;
}

bool stm32_h7xx_otghs2::handle_reset_done()
{
	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::info, "stm32_h7xx_otghs2", "handle_reset_done");

	for(uint8_t i = 0; i <= MAX_NUM_EP; i++)
	{
		ep_unconfig(i);
	}

	flush_rx();
	flush_all_tx();

	Register_util::set_bits(&OTG->GINTMSK, USB_OTG_GINTMSK_OEPINT | USB_OTG_GINTMSK_IEPINT);
	OTGD->DAINTMSK = _VAL2FLD(USB_OTG_DAINTMSK_IEPM, 0x0001) | _VAL2FLD(USB_OTG_DAINTMSK_OEPM, 0x0001);
	OTGD->DOEPMSK  = USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPINT_OTEPSPR | USB_OTG_DOEPINT_STUP | USB_OTG_DOEPMSK_XFRCM;
	OTGD->DIEPMSK  = USB_OTG_DIEPMSK_TOM   | USB_OTG_DIEPMSK_XFRCM;

	return true;
}
bool stm32_h7xx_otghs2::handle_enum_done()
{
	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::info, "stm32_h7xx_otghs2", "handle_enum_done");

	return true;
}
